Reports/СверкаДекларацийПрибыльНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаДекларацийПрибыльНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоляРасшифровки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СверкаДекларацийПрибыльНДС/Forms/Расшифровка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(Отчет, Параметры); 
	Заголовок = Отчеты.СверкаДекларацийПрибыльНДС.ПолучитьТекстЗаголовка(Отчет);
		
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	ПоляРасшифровки = РасшифроватьЯчейку(Расшифровка, ДанныеРасшифровки);
	Регистратор = ПоляРасшифровки.Получить("Регистратор");
	
	Если Не ЗначениеЗаполнено(Регистратор) Тогда  
		Возврат;		
	КонецЕсли;  
	
	Если Отчет.ПоляРасшифровки["Номер"] < 3000 Тогда  
		ОткрытьРеглОтчет(Регистратор);
	Иначе
		ПоказатьЗначение(, Регистратор);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	СформироватьОтчет();

КонецПроцедуры

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьРеглОтчет(Ссылка)
				
	Ячейка = Новый Структура;
	Ячейка.Вставить("Раздел", Отчет.ПоляРасшифровки["Раздел"]);    
	Ячейка.Вставить("Страница", 1);
	Ячейка.Вставить("ИмяЯчейки", Отчет.ПоляРасшифровки["КодМакета"]);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета");
	ПараметрыФормы.Вставить("мСохраненныйДок");
	ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета");
	ПараметрыФормы.Вставить("Организация");
	ПараметрыФормы.Вставить("мВыбраннаяФорма");
		
	Форма = РегламентированнаяОтчетностьВызовСервера.ПолучитьСсылкуНаФормуРеглОтчета(Ссылка, ПараметрыФормы); 
	Форма = СтрЗаменить(Форма, "ОтчетМенеджер.", "");
	Форма = ОткрытьФорму("Отчет." + Форма, ПараметрыФормы, ЭтотОбъект);
						
	Форма.АктивизироватьЯчейку(Ячейка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасшифроватьЯчейку(Идентификатор, АдресРасшифровки)
	
	ЭлементыРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровки).Элементы;
	Возврат Отчеты.СверкаДекларацийПрибыльНДС.ПоляРасшифровкиСКД(ЭлементыРасшифровки[Идентификатор]); 
	
КонецФункции 

#Область ФормированиеОтчета

&НаКлиенте
Процедура СформироватьОтчет()
	
	Задание = НачатьФормированиеОтчета();
	ОжидатьФормированиеОтчета(Задание);
	
КонецПроцедуры

&НаСервере
Функция НачатьФормированиеОтчета()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ПараметрыКомпоновки = ОтчетОбъект.ПараметрыКомпоновки();
		
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = БухгалтерскиеОтчетыКлиентСервер.ПолучитьНаименованиеЗаданияВыполненияОтчета(ЭтотОбъект);
  		
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыЗадания, "Отчеты.СверкаДекларацийПрибыльНДС.СформироватьОтчет", ПараметрыКомпоновки);
	
КонецФункции 
	
&НаКлиенте
Процедура ОжидатьФормированиеОтчета(Задание)
	
	Если Задание.Статус = "Выполняется" Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ФормированиеОтчетаЗавершение", ЭтотОбъект);
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеОтчетаЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт

	Если РезультатВыполнения.Статус = "Ошибка" Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	ЗавершитьФормированиеОтчета(РезультатВыполнения);
	
КонецПроцедуры  

&НаСервере
Процедура ЗавершитьФормированиеОтчета(РезультатВыполнения)
	
	Если Не РезультатВыполнения.Статус = "Выполнено" Тогда
		Возврат;	
	КонецЕсли;
	
	РезультатФормирования = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
	Результат = РезультатФормирования.Результат;
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(РезультатФормирования.ДанныеРасшифровки, УникальныйИдентификатор); 
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти
